//Тема 20. Локальные функции. Домашнее задание.

//Задание 1.

//Напишите функцию, которая принимает два числа и выводит на экран их сумму.

//Числа передаются пользователем в переменные,
//которые затем передаются в функцию.

//Функция должна возвращать результат,
//который в последствии выводится на консоль.


////////////////////////////////////


//Тема 20. Локальные функции. Домашнее задание.

//Задание 2.

//Напишите функцию, которая принимает массив целых чисел
//и возвращает среднее значение элементов массива.

//Массив задать явно

//Функция должна возвращать результат,
//который в последствии выводится на консоль.