//Создать 4 массива.
//Заполнить их случайными числами.

//Конечным результатом должен быть, выведенный на консоль, массив, хранящий следующее:

//Произведение средних арифметических (1и2) и(3и4) массивов поиндексно.

//Пример:

//1 массив = { 4, 8 };
//2 массив = { 16, 2 };

//ср.ариф. 1 и 2 массивов = { 10, 5 }


//3 массив = { 1, 22 };
//4 массив = { 13, 3 };

//ср.ариф. 3 и 4 массивов = { 7, 12.5 }


//Произведение ср. арифметических:

//ср.ариф. 1 и 2 массивов = { 10, 5 }
//ср.ариф. 3 и 4 массивов = { 7, 12.5 }

//Произведение = { 70, 62.5 }

