//Домашнее задание. Тема 18. Урок 2.
//Работа со строками. Метод Split.


//Задача 1:

//Напишите программу, которая принимает от пользователя строку,
//содержащую числа, разделенные запятой.
//Используя метод Split(),
//разделите строку на отдельные числа и найдите их сумму.
//Выведите полученную сумму на экран.

//Пример:

//Введите строку чисел: 10, 20, 30, 40, 50 Сумма чисел: 150


//Задача 2:

//Напишите программу,
//которая запрашивает у пользователя предложение и определяет,
//сколько слов в нем содержатся.
//Для этого используйте метод Split()
//для разделения предложения на отдельные слова и
//подсчитайте их количество. Выведите полученное число на экран.

//Пример:

//Введите предложение: Я люблю программирование Количество слов: 3

