namespace HW_23._05._15_Struct___Enum;
class Program
{
    static void Main(string[] args)
    {
        //    Задание: написать программу ввода и обработки данных структуры для
        //    индивидуального варианта задания.

        //    Все указанные в заданиях даты и время
        //    должны быть представлены по шаблону:
        //    ДД.ММ.ГГГГ и ЧЧ:ММ:СС соответственно.




        // Работа кондиционера в системе «Умный дом»:
        //     -дата включения кондиционера;
        //     -время включения;
        //     -температурный режим(охлаждение, отопление и т.д.);
        //     -заданная температура воздуха.



        //  -вывести сведения обо всех запланированных режимах
        //   с указанием количества оставшихся минут до начала включения кондиционера;
        //
        //  -вывести сведения обо всех запланированных режимах на завтра.
    }
}


